In [4]:
import pandas as pd

dict_1 = {"here's a column":['val 1', 'val 2', 'val 3'],
          "col 2": [4,5,6],
          "col z": ['foo', 'bar', 'baz']}

df_1 = pd.DataFrame(dict_1)
df_1

  here's a column  col 2 col z
0           val 1      4   foo
1           val 2      5   bar
2           val 3      6   baz

In [5]:
list_of_dicts = [{'letter':'A',
                  'word':'foo',
                  'number':1},
                  {'letter':'B',
                  'word':'bar',
                  'number':2},
                  {'letter':'C',
                  'word':'baz',
                  'number':3}]

df_2 = pd.DataFrame (list_of_dicts)
df_2

  letter word  number
0      A  foo       1
1      B  bar       2
2      C  baz       3

In [20]:
company = [{'Name':'Justin Bieber',
                  'Job title':'Manager',
                  'Salary':50000},
                  {'Name':'Jeon Jungkook',
                  'Job title':'CEO',
                  'Salary':100000},
                  {'Name':'Kim Namjoon',
                  'Job title':'Shareholder',
                  'Salary':75000}]

df_3 = pd.DataFrame (company)
df_3

            Name    Job title  Salary
0  Justin Bieber      Manager   50000
1  Jeon Jungkook          CEO  100000
2    Kim Namjoon  Shareholder   75000

In [21]:
print (df_3.info)

<bound method DataFrame.info of             Name    Job title  Salary
0  Justin Bieber      Manager   50000
1  Jeon Jungkook          CEO  100000
2    Kim Namjoon  Shareholder   75000>

In [24]:
df_3 ['Salary']

print (df_3 ['Salary'].sum())

225000

In [31]:
df_3 ['Date started'] = ['23/10/2000', '01/01/2000', '01/01/2023']
df_3

            Name    Job title    Salary Date started  Pay after bonus
0  Justin Bieber      Manager   53350.0   23/10/2000          63350.0
1  Jeon Jungkook          CEO  106700.0   01/01/2000         116700.0
2    Kim Namjoon  Shareholder   80025.0   01/01/2023          90025.0

In [28]:
inflation = 1.067

df_3['Salary'] = df_3['Salary'] * inflation

df_3

            Name    Job title    Salary Date started
0  Justin Bieber      Manager   53350.0   23/10/2000
1  Jeon Jungkook          CEO  106700.0   01/01/2000
2    Kim Namjoon  Shareholder   80025.0   01/01/2023

In [29]:
df_3 ['Pay after bonus'] = df_3['Salary'] + 10000
df_3

            Name    Job title    Salary Date started  Pay after bonus
0  Justin Bieber      Manager   53350.0   23/10/2000          63350.0
1  Jeon Jungkook          CEO  106700.0   01/01/2000         116700.0
2    Kim Namjoon  Shareholder   80025.0   01/01/2023          90025.0

In [41]:
df_3['Birthday'] = ['01-01-1995', '02-02-1996', '03-03-1997']
df_3

df_3['Birthday'] = pd.to_datetime('01-01-1995', format=%d/%m/%y)

SyntaxError: invalid syntax (3793734331.py, line 4)